---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralConnectionHandler
source: html/3ee28cdb-852e-4354-16d9-5baa1bb492ce.htm
---
# StructuralConnectionHandler Members

Adds element ids to the connection.
 All element ids in an array should be of applicable category.